{
  "footer": "Richard Tekula - Portfólio",
  "info": {
    "title": "## Info",
    "age": "Vek: 27",
    "location": "Miesto: Bánovce nad Bebravou",
    "programming": "Programujem od februára 2024 (~16 mesiacov)",
    "english": "Úroveň angličtiny: B1~B2",
    "focus": "Zameranie: Backend Development, API & Security",
    "hobby": "Hobby: Programovanie, Hry, Knihy, 3DPrint"
  },
  "tools": {
    "title": "## Nástroje, ktoré používam",
    "projectControl": "Správa projektov: Git, GitHub",
    "apiTesting": "Testovanie API: Swagger, Postman, Insomnia",
    "ide": "Vývojové prostredia: Visual Studio Code, IntelliJ IDEA",
    "databases": "Databázy: MySQL, PostgreSQL, MongoDB, SQLite"
  },
  "skills": {
    "title": "## Zručnosti",
    "frontend": "HTML, CSS, SCSS, TailwindCSS",
    "backend": "ExpressJS, Spring Boot, FastAPI",
    "languages": "JavaScript (Pokročilý), TypeScript (Základy), Python (Základy), Java (Základy)",
    "frameworks": "React, Next.js, React Native, NodeJS",
    "testing": "Testovanie s Jest, Supertest, Junit"
  },
  "interests": {
    "title": "## Záujmy",
    "frameworks": "Spring Boot, Express.js, Koa, Fastify, FastAPI",
    "focus": "Bezpečnosť, Autentifikácia,Databázy, Real-time aplikácie, Práca so súbormi, Testovanie",
    "ai": "Implementácia AI do reálnych projektov",
    "growth": "Rýchlo sa učím nové technológie a koncepty v programovaní",
    "problemSolving": "Riešenie problémov vo vlastných projektoch a skúmanie rôznych riešení"
  },
  "projects": {
    "title": "## Projekty",
    "backex": {
      "name": "back-ex (štartovací backend)",
      "desc": "Modulárny starter pre Express.js projekty, kde si vieš zvoliť JS/TS, MongoDB, Cloudinary a ďalšie časti podľa potreby. Obsahuje JWT autentifikáciu, validáciu a čistú štruktúru."
    },
    "onepas": {
      "name": "Onepas (Správca hesiel)",
      "desc": "Bezpečný správca hesiel vytvorený v React Native a Expo. Obsahuje registráciu, prihlásenie, odomykanie odtlačkom prsta a osobný dashboard. Používateľ si môže ukladať heslá k rôznym účtom s možnosťou výberu ikony (napr. Facebook) a na zobrazenie hesla musí zadať vlastné dešifrovacie heslo."
    },
    "chatApp": {
      "name": "Live Support Chat",
      "desc": "Aplikácia na živý chat s podporou v reálnom čase postavená na Reacte, Socket.io a Express. Používateľ môže vytvoriť alebo sa pripojiť do súkromnej 1-on-1 miestnosti. Pri vytvorení miestnosti je cez SendGrid automaticky odoslaná e-mailová pozvánka. Podporuje obojsmernú komunikáciu s okamžitými aktualizáciami a logikou pripravenosti miestnosti."
    },
    "school": {
      "name": "School Management API",
      "desc": "RESTful API na správu používateľov a študentov v školskom systéme. Postavené na Node.js, Express.js a PostgreSQL. Obsahuje JWT autentifikáciu, CRUD pre študentov a používateľov, validáciu vstupov cez Zod a vlastný frontend na testovanie API. Nasadené na Railway."
    },
    "ambientSim": {
      "name": "Ambient Simulator (Simulácia inteligentnej domácnosti)",
      "desc": "Simulátor inteligentnej domácnosti v Jave (Swing), kde môžeš ovládať virtuálne zariadenia (svetlá, reproduktory a ďalšie), nastavovať ich parametre a sledovať celkovú spotrebu elektriny v reálnom čase. Všetky údaje o spotrebe sa ukladajú do logov a exportujú na analýzu."
    },
    "webscraper": {
      "name": "Web Scraper",
      "desc": "Jednoduchý a prispôsobiteľný web scraper vytvorený v Pythone s HTML rozhraním. Umožňuje extrahovať konkrétne dáta z webov pomocou vlastných selektorov a filtrov. Ideálne na rýchly zber dát a prototypovanie."
    },
    "fyltr": {
      "name": "fyltr (Nástroj na konverziu obrázkov)",
      "desc": "Python aplikácia na konverziu obrázkov (PNG, JPEG, JPG) do WebP s nastaviteľnou kvalitou. Umožňuje jednoducho pridať obrázky (drag & drop alebo výberom) a stiahnuť ich ako ZIP archív."
    },
    "emailSender": {
      "name": "EmailSender (Posielač denných citátov)",
      "desc": "Spring Boot aplikácia na posielanie personalizovaných HTML e-mailov s inšpiratívnymi citátmi. Využíva SendGrid API na odosielanie a zenquotes.io na získavanie citátov. Podporuje plánované odosielanie (2x denne) a upraviteľnú šablónu e-mailu."
    },
    "loginTemplate": {
      "name": "Login Template (Next.js + NextAuth)",
      "desc": "Opakovateľná šablóna na prihlásenie pre Next.js aplikácie s podporou sociálneho loginu cez Google, Discord, Facebook a GitHub cez NextAuth.js. Jednoducho rozšíriteľné—môžeš pridať ďalších poskytovateľov alebo vlastnú logiku podľa potreby. Údaje o používateľoch sa bezpečne ukladajú (predvolene Supabase) a štruktúra je pripravená na ďalšie úpravy (roly, vlastné polia, atď.)."
    },
    "javaAuth": {
      "name": "Java Auth (Spring Boot + React)",
      "desc": "Jednoduchý boilerplate na prihlásenie cez Java Spring Boot a React. Podporuje login cez Google OAuth2 a generuje bezpečné JWT tokeny pre API. Kód je ľahko rozšíriteľný o ďalších poskytovateľov alebo vlastnú autentifikačnú logiku."
    },
    "discordBot": {
      "name": "Discord Bot",
      "desc": "Pokročilý Discord bot napísaný v TypeScripte, ktorý využíva Discord.js na správu slash príkazov, ankiet, pravidiel, a ďalších interaktívnych funkcií. Podporuje dynamické načítavanie príkazov, odpovedanie na otázky o Discord.js, zobrazovanie počtu členov v serveri, a automatické rozosielanie pravidiel do vybraných kanálov. Vhodné ako ukážka práce s API Discordu, modulárnou štruktúrou a TypeScriptom."
    }
  }
}
